// 16.2. Базы данных и зачем они нужны

<q>
  База данных (БД) — это организованная структура для хранения, изменения и обработки взаимосвязанной информации. Обычно базы данных используют для взаимодействия с большими объёмами данных. Практически ни одна большая компания (от интернет-магазинов до банков) сейчас не обходится без использования баз данных.
</q>

<q>
  Транзакция — это ряд действий, выполняемых подряд, которые должны быть обработаны полностью, или в случае сбоя БД быть восстановлены до состояния, пока транзакция не началась.
</q>

<pre><code class="language-md">
  - `SELECT` — отвечает за то, какие колонки будут выбираться из данных.
  - `FROM` — отвечает за то, из какой таблицы эти данные.
  - `WHERE` — отвечает за фильтрацию строк в данных.
</code></pre>
