// 23.9. Магические методы

<div class="text-2xl mt-4 mb-2">Магические методы</div>

<pre><code class="language-md">
  - `__construct()` — вызывается при инициализации объект
  - `__invoke()` — задает поведение при вызове объекта как функции
  - `__isset()` — проверяет свойство на существование
  - `_unset()` — задает поведение объекта при попытке удалить такие свойства
  - `__get()` — вызывается для `доступа` к приватным или несуществующим свойствам
  - `__set()` — вызывается для `установки` доступа к приватным или несуществующим свойствам
</code></pre>
